In [33]:
import pandas as pd

In [34]:
df=pd.read_csv("titanic.csv")

In [35]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [36]:
df.drop(['PassengerId','Name','Ticket','Fare','Cabin','Embarked','SibSp'],axis="columns",inplace=True)

In [37]:
df

     Pclass     Sex   Age  Parch  Survived
0         3    male  22.0      0         0
1         1  female  38.0      0         1
2         3  female  26.0      0         1
3         1  female  35.0      0         1
4         3    male  35.0      0         0
..      ...     ...   ...    ...       ...
886       2    male  27.0      0         0
887       1  female  19.0      0         1
888       3  female   NaN      2         0
889       1    male  26.0      0         1
890       3    male  32.0      0         0

[891 rows x 5 columns]

In [38]:
dumies=pd.get_dummies(df.Sex)

In [39]:
ndf=pd.concat([df,dumies],axis="columns")

In [40]:
ndf

     Pclass     Sex   Age  Parch  Survived  female  male
0         3    male  22.0      0         0       0     1
1         1  female  38.0      0         1       1     0
2         3  female  26.0      0         1       1     0
3         1  female  35.0      0         1       1     0
4         3    male  35.0      0         0       0     1
..      ...     ...   ...    ...       ...     ...   ...
886       2    male  27.0      0         0       0     1
887       1  female  19.0      0         1       1     0
888       3  female   NaN      2         0       1     0
889       1    male  26.0      0         1       0     1
890       3    male  32.0      0         0       0     1

[891 rows x 7 columns]

In [41]:
ndf.drop(['Sex'],axis="columns",inplace=True)

In [42]:
ndf

     Pclass   Age  Parch  Survived  female  male
0         3  22.0      0         0       0     1
1         1  38.0      0         1       1     0
2         3  26.0      0         1       1     0
3         1  35.0      0         1       1     0
4         3  35.0      0         0       0     1
..      ...   ...    ...       ...     ...   ...
886       2  27.0      0         0       0     1
887       1  19.0      0         1       1     0
888       3   NaN      2         0       1     0
889       1  26.0      0         1       0     1
890       3  32.0      0         0       0     1

[891 rows x 6 columns]

In [43]:
ndf.columns[ndf.isna().any()]

Index(['Age'], dtype='object')

In [44]:
ndf.Age = ndf.Age.fillna(ndf.Age.mean())

In [64]:
ndf

     Pclass        Age  Parch  Survived  female  male
0         3  22.000000      0         0       0     1
1         1  38.000000      0         1       1     0
2         3  26.000000      0         1       1     0
3         1  35.000000      0         1       1     0
4         3  35.000000      0         0       0     1
..      ...        ...    ...       ...     ...   ...
886       2  27.000000      0         0       0     1
887       1  19.000000      0         1       1     0
888       3  29.699118      2         0       1     0
889       1  26.000000      0         1       0     1
890       3  32.000000      0         0       0     1

[891 rows x 6 columns]

In [46]:
X=ndf.iloc[:,[0,1,2,4,5]]
y=ndf.iloc[:,3]

In [47]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=0)

In [48]:
from sklearn.preprocessing import StandardScaler
ss=StandardScaler()
X_train=ss.fit_transform(X_train)
X_test=ss.fit_transform(X_test)

In [49]:
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier()
clf.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [56]:
y_pred=clf.predict(X_test)

In [57]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)

0.7713004484304933

In [61]:
clf.predict(ss.transform([[1,38,0,1,0]]))

array([1], dtype=int64)